{"results":[{"utc_offset":3600000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Rijswijk","address_1":"Verrijn Stuartlaan 20","name":"Competa Conference Center","lon":4.335614,"id":5154842,"lat":52.041637,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1520516833000,"rating":{"count":3,"average":5},"maybe_rsvp_count":0,"description":"<p>• What we'll do<br/>The evening will start at 18:00, where you can grab a drink and we will enjoy dinner together. On the menu will be soup, a salad, bami with chicken and a dessert. This will give you a chance to share your thoughts with other developers and connect with new people.</p> <p>At 19:00 the Techtalk will start, two speakers will talk about two different topics:</p> <p>René Post will give an introduction to GRAND Stack.<br/>\"GRAND Stack is an acronym for GraphQL, React, Apollo and Neo4j Database. In this presentation, you will get an overview of the GRAND Stack, some pointers to get started and a walkthrough of a simple example app.\"</p> <p>Andrey Zakharov will talk about Artificial intelligence (AI)<br/>\"Artificial intelligence is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by humans and other animals. In this presentation, we will dive deeper into the world of AI.\"</p> <p>• What to bring</p> <p>• Important to know</p>","event_url":"https://www.meetup.com/Competa-Tech-Talks/events/248536776/","yes_rsvp_count":43,"duration":10800000,"name":"Competa Techtalk March","id":"248536776","photo_url":"https://secure.meetupstatic.com/photos/event/e/4/f/f/global_469078623.jpeg","time":1521651600000,"updated":1521714998000,"group":{"join_mode":"open","created":1331045494000,"name":"Competa Tech Talks","group_lon":4.360000133514404,"id":3425242,"urlname":"Competa-Tech-Talks","group_lat":52.04999923706055,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Rijswijk","address_1":"Verrijn Stuartlaan 20","name":"Competa Conference Center","lon":4.335614,"id":5154842,"lat":52.041637,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1523354603000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p>The evening will start at 18:00, where you can grab a drink and we will enjoy dinner together. This will give you a chance to share your thoughts with other developers and connect with new people.</p> <p>At 19:00 the Techtalk will start, multiple speakers will talk about different topics.</p> <p>Bjørn Wikkeling will talk about Artificial intelligence (AI)<br/>\"Artificial intelligence is intelligence demonstrated by machines, in contrast to the natural intelligence displayed by humans and other animals. In this presentation, we will dive deeper into the world of AI.\"</p> <p>Jeroen will talk about Blockchain<br/>\"Blockchain is a continuously growing list of records, called blocks, which are linked and secured using cryptography.\"</p> <p>Raymon will do a presentation about Javascript Intersection Observers<br/>\"The Intersection Observer API provides a way to asynchronously observe changes in the intersection of a target element with an ancestor element or with a top-level document's viewport.\"</p> <p>And last but not least, Fernando will talk about Artificial Neural Networks<br/>\"Artificial neural networks (ANNs) are computing systems vaguely inspired by the biological neural networks that constitute animal brains. Such systems \"learn\" (progressively improve performance on) tasks by considering examples, generally without task-specific programming.\"</p>","event_url":"https://www.meetup.com/Competa-Tech-Talks/events/249629419/","yes_rsvp_count":54,"duration":10800000,"name":"Competa Techtalk May","id":"249629419","photo_url":"https://secure.meetupstatic.com/photos/event/4/1/3/global_470041043.jpeg","time":1527091200000,"updated":1527236468000,"group":{"join_mode":"open","created":1331045494000,"name":"Competa Tech Talks","group_lon":4.360000133514404,"id":3425242,"urlname":"Competa-Tech-Talks","group_lat":52.04999923706055,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Rijswijk","address_1":"Verrijn Stuartlaan 20","name":"Competa Conference Center","lon":4.335614,"id":5154842,"lat":52.041637,"repinned":true},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1534840740000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>• What we'll do<br/>The evening will start at 18:00, where you can grab a drink and we will enjoy dinner together. On the menu will be soup, a salad, bami with chicken and a dessert. This will give you a chance to share your thoughts with other developers and connect with new people.</p> <p>At 19:00 the Techtalk will start, Three speakers will talk about three different topics we will announce them later</p> <p>Carina Semerdzhan will talk about the topic \"From nerd to googler\"<br/>\"Do you want to code as a real google engineer?<br/>Do you want to be a real bearded programmer and an algorithms guru?<br/>Do you have no ideas about Java or C ++?<br/>And still, do not want to break up with javascript?<br/>If you answer yes at least one time, you have not to miss it!<br/>This talk has been prepared in the collaboration with a Google engineer and will cover typical questions of the big companies interviews in the javascript wrap!\"</p> <p>Giovane Moura will talk about Engineering for DDoS attacks: a case study using DNS<br/>\"Abstract: Denial-of-service attacks have become cheaper, bigger, and more frequent over the last years. Currently, the biggest known DDoS to date peaked at 1.7 Tb/s. The rise of the so-called IoT botnets means that services are now vulnerable to a massive army sizeable to originate legitimate traffic (no spoofed packets).<br/>In this talk, we will use the DNS system as case study and present the research we have been carrying out over the last years within the SAND project (<a href=\"http://www.sand-project.nl/\" class=\"linkified\">http://www.sand-project.nl/</a>) to better engineer DNS in the face of rising DDoS attacks, and we show how our recommendations were ultimately deployed at SIDN (.nl operator), as well as others. Even though our case study is DNS, participants can also use some of the recommendations in others services.<br/>Short bio: Giovane C. M. Moura is a Data Scientist with SIDN Labs (the research arm of SIDN) and a Research Guest at The Cyber Security at Delft University of Technology. His research focuses on Internet routing and engineering, as well as security. He holds a PhD from the University of Twente (2013).\"</p> <p>Faris Tangastani will talk about his personal take on starting with a React<br/>\"This topic will be about learning something new, specifically React. It will be half talking and sharing my experience and maybe gauging other peoples experiences of how to learn something that may seem daunting. As well as the half workshop where we can have a look at some of the ways you can introduce and learn React to eventually add it to your own personal stack.\"</p>","event_url":"https://www.meetup.com/Competa-Tech-Talks/events/253970526/","yes_rsvp_count":40,"duration":10800000,"name":"Competa TechTalk September","id":"253970526","time":1538064000000,"updated":1538077329000,"group":{"join_mode":"open","created":1331045494000,"name":"Competa Tech Talks","group_lon":4.360000133514404,"id":3425242,"urlname":"Competa-Tech-Talks","group_lat":52.04999923706055,"who":"Members"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":3,"link":"https://api.meetup.com/2/events","count":3,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=Competa-Tech-Talks&time=1514764800000%2C1546214400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1538077329000,"lat":""},"ratelimit":{"limit":"30","remaining":"28","reset":"8"}}