{"results":[{"utc_offset":7200000,"rsvp_limit":10,"headcount":0,"visibility":"public","waitlist_count":0,"created":1499794535000,"rating":{"count":4,"average":4.75},"maybe_rsvp_count":0,"description":"<p>\"How does a project get to be a year late? ... One day at a time.\"</p> <p>The book <i>The Mythical Man Month</i> is over 40 years old, and is one of the foundations of modern thought in Software Engineering. At this event we will discuss <b>Chapter 14: Hatching a Catastrophe</b>, which expands on the question posed above, and provides useful ideas for how to keep software projects on track. We will review the topic as presented in the chapter, discuss how the ideas in the book have held up through the years, and finally share instances in our own development experience that relate to what we've discussed so far.</p> <p>The book is available through almost any online bookstore, though if you just want Chapter 14 an old version is available for free from <a href=\"https://archive.org/details/mythicalmanmonth00fred\">the internet archive</a>. If you haven't read the book, I highly recommend picking up a copy and going through it in its entirety. </p> <p>Please read the chapter in advance - it's only 10 pages, but has hours of ideas within.</p> <p>The location is Cafe Dudok, in the central area of Den Haag. We have enough seating for 10 people, so please RSVP early to claim your seat, and keep your RSVP status up to date.</p> <p>I'm looking forward to our discussion, and if you have any questions or suggestions, please feel free to send a message!</p>","event_url":"https://www.meetup.com/Software-Development-Dinner-Club-Den-Haag/events/241602974/","yes_rsvp_count":9,"duration":7200000,"name":"Learn the answer to, \"How does a software project get to be a year late?\"","id":"241602974","time":1501518600000,"updated":1501660967000,"group":{"join_mode":"open","created":1499775758000,"name":"Software Development Dinner Club - Den Haag","group_lon":4.28000020980835,"id":24938960,"urlname":"Software-Development-Dinner-Club-Den-Haag","group_lat":52.08000183105469,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Hofweg 1-a 2511 AA","name":"Cafe Dudok","lon":4.31169,"id":18167512,"lat":52.07856,"repinned":false},"rsvp_limit":10,"headcount":0,"visibility":"public","waitlist_count":0,"created":1501611296000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p>\"How do you estimate and plan a software project?\" This question was at the core of the conversation last meeting. Fortunately the aptly named book, \"<i>Agile Estimating and Planning</i>\" by Mike Cohn has some useful answers.</p> <p>At this event we will discuss <b>Part I: The Problem and the Goal</b>, <b>Part II: Estimating Size</b>, and <b>Part III: Planning for Value</b>, which collectively provide motivation and a practical approach to agile planning. We will review the topic as presented in these sections, and discuss how we feel about the ideas in the book. We will also take the time to actually run through a planning exercise and put our new found knowledge to the test!</p> <p>The book is available through both amazon and bol.com, and can <a href=\"http://www.informit.com/store/agile-estimating-and-planning-9780131479418\">also be purchased in ebook format</a>. If you have trouble finding a copy of the book or cannot buy it due to monetary considerations, but still want to join, please contact me (Noah).</p> <p>Please read these three parts in advance of the meeting. Together they comprise less than half of the book, but will be critical for participation. The rest of the book is also valuable, so feel free to read more!</p> <p>The location is Cafe Dudok, in the central area of Den Haag. Seating is limited, so please RSVP early to claim your seat, and keep your RSVP status up to date. If you attended the previous event and are unable to RSVP to this one because it is full, simply message me and I will add you to the list.</p> <p>I'm looking forward to our discussion, and if you have any questions or suggestions, please feel free to send a message!</p>","how_to_find_us":"Look for a sign with SDBC written in large black letters","event_url":"https://www.meetup.com/Software-Development-Dinner-Club-Den-Haag/events/242197904/","yes_rsvp_count":10,"name":"Learn the answer to, \"How do you estimate and plan a software project?\"","id":"242197904","time":1503937800000,"updated":1504712782000,"group":{"join_mode":"open","created":1499775758000,"name":"Software Development Dinner Club - Den Haag","group_lon":4.28000020980835,"id":24938960,"urlname":"Software-Development-Dinner-Club-Den-Haag","group_lat":52.08000183105469,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Hofweg 1-a 2511 AA","name":"Cafe Dudok","lon":4.31169,"id":18167512,"lat":52.07856,"repinned":false},"rsvp_limit":20,"headcount":0,"visibility":"public","waitlist_count":0,"created":1504560530000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Now it's time for a fun look at the people in software development. Peter Siebel interviews 15 of the top programmers of our time in his book, <i><b><a href=\"http://www.codersatwork.com/\">Coders at Work: Reflections on the Craft of Programming</a></b>. </i>They provide insight into how they think, their views on the craft of software development and more. For this event we'll keep it simple and focus on the the first two interviews:</p> <p><b>Chapter 1: Jamie Zawinski </b> <b>- </b>\"In 1998 Zawinski was one of the prime movers...behind mozilla.org, the organization that took the Netscape browser open source.\"</p> <p><b>Chapter 2: Brad Fitzpatrick - </b>\"Keeping up with LiveJournal’s ever-growing popularity forced Fitzpatrick to learn the hard way about building scalable web sites and along the way he and the programmers at the company he founded, Danga Interactive, ended up building several pieces of open source software, including memcached, Perlbal, and MogileFS, which are now used on the servers of many of the world’s busiest web sites.\"</p> <p>The book is available anywhere you can buy software books online, however feel free to <a href=\"http://one-shore.com/aaron/books/coders-at-work.pdf\">take a peek at the content</a> before deciding whether to dive in.</p> <p>Please read the specified two interviews in advance of the event so that we can discuss what we read together. They comprise fewer than 90 pages of light reading, but will be critical for participation. The rest of the book is also interesting, so feel free to read more!</p> <p>The location is Cafe Dudok, in the central area of Den Haag. Seating is limited, so please RSVP early to claim your seat, and keep your RSVP status up to date. If you attended the previous event and are unable to RSVP to this one because it is full, simply message me and I will add you to the list.</p> <p>I'm looking forward to our discussion, and if you have any questions or suggestions, please feel free to send a message!</p>","how_to_find_us":"Look for a sign on the table that says 'SDBC'","event_url":"https://www.meetup.com/Software-Development-Dinner-Club-Den-Haag/events/243096888/","yes_rsvp_count":5,"name":"Coders at Work: Reflections on the Craft of Programming","id":"243096888","time":1506961800000,"updated":1506975980000,"group":{"join_mode":"open","created":1499775758000,"name":"Software Development Dinner Club - Den Haag","group_lon":4.28000020980835,"id":24938960,"urlname":"Software-Development-Dinner-Club-Den-Haag","group_lat":52.08000183105469,"who":"Members"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Hofweg 1-a 2511 AA","name":"Cafe Dudok","lon":4.31169,"id":18167512,"lat":52.07856,"repinned":false},"rsvp_limit":20,"headcount":0,"visibility":"public","waitlist_count":0,"created":1504561478000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>The book, <i>User Story Mapping: Discover the Whole Story, Build the Right Product </i>is teaches the technique of User Story Mapping, but is really about how to communicate in a software development world. Here's an excerpt from its self-description:</p> <p>\"Because so many organizations have adopted Agile and Lean processes, and stories along with them, you may fall into one or more of the traps caused by misconceptions about stories...I’ll try to wipe away the misconceptions that lead to those traps in the first place. You’ll learn how to think of the big picture, how to plan and estimate in the large (and in the small), and how to have productive conversations about what users are trying to accomplish, as well as what a good piece of software needs to do to help them.\"</p> <p>Come join us to chat about User Story Mapping, what you've learned, and what you think of the technique. This meetup is scheduled 2 months in advance so there should be more than enough time to read the whole thing! An understanding of the techniques in User Story Mapping will be critical to participation in our discussion.</p> <p>The location is Cafe Dudok, in the central area of Den Haag. Seating is limited, so please RSVP early to claim your seat, and keep your RSVP status up to date. If you attended a previous event and are unable to RSVP to this one because it is full, simply message me and I will add you to the list.</p> <p>I'm looking forward to our discussion, and if you have any questions or suggestions, please feel free to send a message!</p>","how_to_find_us":"Look for a sign on the table that says 'SDBC'","event_url":"https://www.meetup.com/Software-Development-Dinner-Club-Den-Haag/events/243097383/","yes_rsvp_count":9,"name":"Learn an answer to, \"How do I communicate with my team?\"","id":"243097383","time":1510075800000,"updated":1510089139000,"group":{"join_mode":"open","created":1499775758000,"name":"Software Development Dinner Club - Den Haag","group_lon":4.28000020980835,"id":24938960,"urlname":"Software-Development-Dinner-Club-Den-Haag","group_lat":52.08000183105469,"who":"Members"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":4,"link":"https://api.meetup.com/2/events","count":4,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=Software-Development-Dinner-Club-Den-Haag&time=1483228800000%2C1514678400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1510089139000,"lat":""},"ratelimit":{"limit":"30","remaining":"26","reset":"5"}}