{"results":[{"utc_offset":3600000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Rotterdam","address_1":"On Your Computer","name":"Online Event","lon":4.477733,"id":24364516,"lat":51.924419,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1518822973000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>For the second session in our ICS Security Virtual Meeting series, Bryan Singer and Emmet Moore III take us Inside the Control System – Components, Processes, and Automation</p> <p>February 22, 2018</p> <p>2 CPE Credits available for attendees</p> <p>This session covers hardware, software, systems, information flow and operations unique to these environments (to include PLC’s, HMIs, Historians, Field Devices, Controller devices, Operating Systems (yes Microsoft)). We will cover basic network structure and design architecture related to technical components (PLC, HMIs, Field devices, etc.) and information. The variety of control system architectures across various sectors (electrical, manufacturing, transportation, health, etc.) will be addressed.</p> <p>This session will address questions including:<br/>- What components are found inside a control or operating technology system?<br/>- What is process control?<br/>- What is a set point or a flow point?<br/>- What are an engineering Safety Systems?<br/>- What are the primary directives for these systems?<br/>- What differentiates these components from their IT equivalents?</p> <p>Register now at <a href=\"https://www.cs2ai.org/virtual-meeting-series/\" class=\"linkified\">https://www.cs2ai.org/virtual-meeting-series/</a><br/>(Also to watch recorded sessions!)</p> <p>Discussion Leader: Bryan Singer</p> <p>Bryan has an extensive background in a variety of industries including manufacturing, DoD, healthcare, and others. His proven professional skills include system architecture and design, software project management, application development, system administration, network administration, database design and administration, and multi-tier support. Previously he was the chairman of ISA-62443/ISA-99 Industrial Control Systems Security Standards body; Interim Governing Board, for the Process Control Security Forum; and an industry representative for security architecture concerns to almost every major manufacturing, utilities, and other critical infrastructure. His specialties are: 1) System Architecture and Design using methodologies including UML, Rational Unified Process, Booch, Yourdon, etc.; 2) MES, EAI, ERP, LIMS, PLC, DCS, HMI, and other manufacturing systems; 3) Client/Server development in Java, JSP, ASP, C/C++, Visual C++, VB, PERL, Shell (ksh, csh, sh, bash), SQL, PL/SQL, and HTML; 4) Physical and network vulnerability assessments, penetration testing, information assurance, and biometrics, and; 5) • PGP, SSH, VPN, WEP, SSL, WAP, 802.1x, RADIUS, etc<br/><a href=\"https://www.linkedin.com/in/bryanlsinger/\" class=\"linkified\">https://www.linkedin.com/in/bryanlsinger/</a></p> <p>Discussion Leader: Emmett Moore</p> <p>Emmett is the founder and CEO of Red Trident Inc.. Over the years, he has focused on Threat Intelligence, Vulnerability Research, and Security Services. He has been responsible for all aspects of the product development life cycle in the Oil &amp; Gas Industry. As a project specialist he handled a multitude of roles, which included managing high level automation projects for the oil and gas industry, as well as being a technical specialist various other projects.<br/><a href=\"https://www.linkedin.com/in/emooreiii/\" class=\"linkified\">https://www.linkedin.com/in/emooreiii/</a></p>","how_to_find_us":"This is an online event - registration link is in event details","event_url":"https://www.meetup.com/Den-Haag-Cyber-Security-for-Control-Systems/events/247883566/","yes_rsvp_count":1,"duration":5400000,"name":"Inside the Control System – Components, Processes, and Automation","id":"247883566","photo_url":"https://secure.meetupstatic.com/photos/event/9/0/c/9/global_468517065.jpeg","time":1519311600000,"updated":1519323337000,"group":{"join_mode":"open","created":1478219252000,"name":"Den Haag Cyber Security for Control Systems","group_lon":4.28000020980835,"id":21032769,"urlname":"Den-Haag-Cyber-Security-for-Control-Systems","group_lat":52.08000183105469,"who":"Professionals"},"status":"past"},{"utc_offset":7200000,"venue":{"zip":"35630","country":"us","localized_country_name":"USA","city":"Florence","address_1":"NA","name":"Virtual Meetup - Registration required (see link below)","lon":-87.68038,"id":25865167,"state":"al","lat":34.805473,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1529536538000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Please join us to discuss the keys to an effective control system security program with MILLE GANDELSMAN of Indegy, KARL PERMAN of KPMG, BOB BEVIS of Verve Industrial Protection, and ERNEST WOHNIG of System 1.</p> <p>June 28, 2018 at 10:00 am Eastern US Time</p> <p>* * REGISTER NOW * * at <a href=\"https://www.cs2ai.org/virtual-meeting-series/\" class=\"linkified\">https://www.cs2ai.org/virtual-meeting-series/</a></p> <p>(Also for recorded sessions!)</p> <p>2 CPE Credits available for attendees</p> <p>The discussion leaders will each deliver 5-10 minutes of prepared content and then YOU, the audience, will ask questions to help guide the panel discussion! Which means that you will be able to actively participate in the live discussion!</p> <p>ABSTRACT:<br/>This session will identify the key areas that enable organizations to run effective control systems security programs. Core to this will be understanding how prioritization is accomplished in situations where most of us do not and may never have enough resources.</p> <p>This session will introduce key elements including but not limited to budgets, governance, policy, assessments, incident response, change management and overall risk management techniques, with a deeper look at some of these same areas in forthcoming sessions.</p> <p>DISCUSSION LEADER: MILLE GANDELSMAN<br/>Mille leads Indegy’s technology research and product management activities. Prior to Indegy, Mille led engineering efforts for Stratoscale and spent several years leading cyber security research for Israel’s elite intelligence corps. Mille is a graduate of the elite Talpiot military academy and holds a Masters degree with honors in Computer Science from Tel Aviv University.</p> <p>DISCUSSION LEADER: ERNEST WOHNIG<br/>Ernest is an internationally recognized cyber security and assurance leader having written, presented, and advised senior corporate and federal leadership on security and assurance issues across the energy sector and to the federal government for over 20 years. He has advised clients across several industries, helping them understand their risk posture and to develop proactive security strategies and programs resulting in clear alignment of security investments to business value. Mr. Wohnig is one of the key figures shaping the discussion and practice of cyber security in the critical infrastructure and industrial control system arenas.</p> <p>DISCUSSION LEADER: ROBERT BEVIS<br/>Bob is the founder of Verve Industrial and leads the technical vision for the company. With over 25 years of cyber security, ICS system design, and project management, Bob’s unique ability to understand cyber security requirements (including NERC-CIP) in an operating environment enable scalable, cost effective and efficient security solutions.</p> <p>DISCUSSION LEADER: KARL PERMAN<br/>Karl is the Operational Technology Security Lead in KPMG’s Risk Consulting practice with over 30 years of experience delivering critical infrastructure, business protection, compliance, risk management and law enforcement consulting services. He has developed and implemented critical infrastructure protection programs, developed security technology infrastructure to protect assets, created vulnerability assessments in diverse environments, established organizational strategies and value-added security programs, and led high-level, complex investigations of criminal conduct and employee misconduct. His career includes senior level positions including Director of Security, North American Transmission Forum; Manager, Infrastructure Protection and Regulatory Compliance at Exelon Corporation; and Manager, Corporate Investigative and Protective Services at Southern California Edison.</p>","how_to_find_us":"https://cs2ai.org/meetup-discussions/keys-to-an-effective-control-system-security-program/","event_url":"https://www.meetup.com/Den-Haag-Cyber-Security-for-Control-Systems/events/251965720/","yes_rsvp_count":1,"duration":5400000,"name":"ICS Security Virtual Meetup 6:Keys to Effective Control System Security Programs","id":"251965720","photo_url":"https://secure.meetupstatic.com/photos/event/3/6/3/7/global_472213879.jpeg","time":1530194400000,"updated":1530202427000,"group":{"join_mode":"open","created":1478219252000,"name":"Den Haag Cyber Security for Control Systems","group_lon":4.28000020980835,"id":21032769,"urlname":"Den-Haag-Cyber-Security-for-Control-Systems","group_lat":52.08000183105469,"who":"Professionals"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":2,"link":"https://api.meetup.com/2/events","count":2,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=Den-Haag-Cyber-Security-for-Control-Systems&time=1514764800000%2C1546214400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1530202427000,"lat":""},"ratelimit":{"limit":"30","remaining":"23","reset":"1"}}