{"results":[{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Binckhorstlaan 36","address_2":"C1 23","name":"Eonics HQ","lon":4.33493,"id":25852396,"lat":52.07392,"repinned":false},"rsvp_limit":15,"headcount":0,"visibility":"public","waitlist_count":0,"created":1528276476000,"rating":{"count":1,"average":4},"maybe_rsvp_count":0,"description":"<p>Aanstaande woensdag 20 juni is het eindelijk zover: de Eonics Open Hack Night Pt. 11! We zullen deze avond kennismaken met de makers van HyperDev die ons alles gaan vertellen over dit nieuwe CI/CD platform dat al bij meerdere Eonics projecten met succes wordt ingezet.</p> <p>HyperDev is gebouwd dóór en vóór developers &amp; testers. Het platform biedt alles wat je nodig hebt voor moderne softwareontwikkeling volgens de DevOps werkwijze. Je kunt het zien als een kant en klare ontwikkelstraat die je volledig naar eigen wens kunt inrichten en aanpassen, zonder kostbare tijd te verspillen aan beheer en infrastructuur. HyperDev is gebouwd op Docker Swarm. Het HyperDev dashboard en de bijbehorende API ontsluiten alle functionaliteiten voor de ontwikkelaars. Daarnaast is het heel eenvoudig om met een druk op de knop (of een simpele API call) volledige omgevingen te starten en te stoppen. Op deze manier kunnen ook testers en andere stakeholders eenvoudig gebruikmaken van de voordelen van HyperDev. Omdat alles binnen HyperDev dockerized en geversioneerd is, kunnen er op ieder moment een willekeurig aantal gescheiden omgevingen en applicaties worden gestart, zonder dat deze elkaar beïnvloeden zoals in een klassieke ontwikkel- of testomgeving vaak het geval is.</p> <p>Meer informatie:</p> <p>- <a href=\"http://hyperdev.io\" class=\"linkified\">http://hyperdev.io</a><br/>- <a href=\"https://eonics.nl/inbox/open-hack-night-pt-11-ci-cd-met-hyperdev\" class=\"linkified\">https://eonics.nl/inbox/open-hack-night-pt-11-ci-cd-met-hyperdev</a></p>","event_url":"https://www.meetup.com/HyperDev-Meetup/events/251469064/","yes_rsvp_count":8,"duration":12600000,"name":"HyperDev: Cloud based docker platform","id":"251469064","time":1529508600000,"updated":1529565953000,"group":{"join_mode":"open","created":1528274681000,"name":"HyperDev Meetup","group_lon":4.28000020980835,"id":28722953,"urlname":"HyperDev-Meetup","group_lat":52.08000183105469,"who":"Leden"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Binckhorstlaan 36","address_2":"C1 23","name":"Eonics HQ","lon":4.33493,"id":25852396,"lat":52.07392,"repinned":false},"rsvp_limit":15,"headcount":0,"visibility":"public","waitlist_count":0,"created":1537372052000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Als je al bekend bent met de Eonics werkwijze weet je dat we graag werken met Docker en HyperDev. Deze tools maken hoge kwaliteit software-ontwikkeling een stuk eenvoudiger voor ontwikkelaars en andere betrokkenen. In deze Open Hack Night zullen we inzoomen op een specifieke onderdeel van dit ontwikkel-proces; browser-based testen met behulp van het TestX framework in een Dockerized omgeving (ook de geautomatiseerde testen draaien in een container). Dit test-framework is gebaseerd op Protractor en integreert uitstekend met Docker en HyperDev. Dit is niet verwonderlijk aangezien het ontwikkeld wordt door HyperDev mede-oprichter Gantcho Kojuharov, die ook aanwezig zal zijn.</p> <p>Deze Open Hack Night wordt geleid door Vince van Oosten. Vince heeft als DevOps expert bij Eonics al veel met TestX gewerkt, waarbij hij het framework zelfs heeft toegepast buiten het test-domein. Inmiddels heeft hij dan ook diverse patches aangedragen die het framework verder hebben verbeterd en uitgebreid. Na de inleidende presentatie, natuurlijk gevolgd door de traditionele pizza-pauze, gaan we zelf de mouwen opstropen en onder begeleiding kennismaken met de voordelen van deze werkwijze. Kortom: een leerzame avond voor iedere software engineer die veel in een devops context werkt.</p>","event_url":"https://www.meetup.com/HyperDev-Meetup/events/254821509/","yes_rsvp_count":6,"duration":14400000,"name":"Container based test automation","id":"254821509","time":1537974000000,"updated":1537991337000,"group":{"join_mode":"open","created":1528274681000,"name":"HyperDev Meetup","group_lon":4.28000020980835,"id":28722953,"urlname":"HyperDev-Meetup","group_lat":52.08000183105469,"who":"Leden"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":2,"link":"https://api.meetup.com/2/events","count":2,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=HyperDev-Meetup&time=1514764800000%2C1546214400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1537991337000,"lat":""},"ratelimit":{"limit":"30","remaining":"24","reset":"3"}}