{"results":[{"utc_offset":3600000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"'s-Gravenhage","address_1":"Waldorpstraat 17F","name":"Q42","lon":4.323534,"id":11972132,"lat":52.069256,"repinned":false},"rsvp_limit":50,"headcount":0,"visibility":"public","waitlist_count":0,"created":1513947821000,"rating":{"count":2,"average":4.5},"maybe_rsvp_count":0,"description":"<p>• What we'll do<br/>Join the creators, director, technical heads and producers of the upcoming humanitarian VR documentary ‘Meet The Soldier’ (<a href=\"http://meetthesoldier.com\" class=\"linkified\">http://meetthesoldier.com</a>) in an open conversation about all that VR has (had) to offer in the world of humanitarian film. Next to the discussion, we have a number of humanitarian VR films ready to watch on a number of VR devices (and maybe you’ll even get a sneak preview of Meet The Soldier…). 360 teaser: <a href=\"https://www.youtube.com/watch?v=QXgXVzfd3zM\" class=\"embedded\">https://www.youtube.com/watch?v=QXgXVzfd3zM</a></p> <p>Meet The Soldier is a humanitarian VR documentary about bringing together two enemy tribal warriors in Karamoja, Uganda - in VR. Last August, the whole crew travelled to Karamoja, Uganda for production, and they’re ready to share their impressive (and sometimes insane) stories. Curious to learn what is it like to shoot a VR film in the most remote and illiterate area of East Africa? How to deal with all the **** you’ll walk into, from power cuts to mudslides on the road?</p> <p>We get both the creative and the tech side to the table, as Teddy Cherim (director) and Yori van Gerven (VR technician/director) will discuss the power of empathy in humanitarian stories. As experts argue, VR may eventually allow us to virtually walk in someone else’s shoes to the point where our brains may not be able to tell the difference between what’s reality and what’s a simulation - pure empathy. But as others warn, “empathy is not something that automatically happens when a user puts on a headset.” How does this relate to humanitarian filmmaking? Do such stories really feel stronger when the viewer gets immersed into a virtual environment?</p> <p>Let’s unite and explore what the exciting future of humanitarian storytelling holds!</p> <p>Planning:<br/>18:00 - 18:30: Introduction of guests and teaser of Meet The Soldier<br/>18:30 - 19:30: Open discussion on ‘Humanitarian Storytelling in VR’<br/>19:30 - 21:00: Open showcase Humanitarian VR films + drinks</p> <p>Teddy Cherim is a film director, writer, creative and all-round, stand up, ‘wish you were here’ kinda guy. Teddy studied at the Metropolitan Film School in London, after which he returned to Amsterdam to make the feature film Sterke Verhalen, which he wrote and directed together with Kees van Nieuwkerk. In 2014 Teddy moved to Nairobi to become Creative Director at MIATV, a regional media conglomerate developing local high impact television programmes and documentaries. Since 2016, Teddy has been back in Amsterdam from where he has been working as a freelance writer, director and creative, shooting all over the world.</p> <p>• What to bring<br/>If you have any type of VR goggles yourself, do bring them!</p>","how_to_find_us":"3 minute walk from Den Haag HS; for parking check http://www.theglobeden-haag.nl/wijziging-parkeren/","event_url":"https://www.meetup.com/Hack-The-Planet/events/246117676/","yes_rsvp_count":29,"duration":10800000,"name":"Humanitarian Storytelling in VR","id":"246117676","photo_url":"https://secure.meetupstatic.com/photos/event/9/8/0/b/global_467078923.jpeg","time":1516899600000,"updated":1517087570000,"group":{"join_mode":"open","created":1513935630000,"name":"Hack The Planet","group_lon":4.28000020980835,"id":26936568,"urlname":"Hack-The-Planet","group_lat":52.08000183105469,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Juliana van Stolberglaan 10","name":"The Hague Tech","lon":4.331146,"id":24963073,"lat":52.082062,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1528194182000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>N.B.: You need a Border Sessions ticket to attend this event: <a href=\"https://www.bordersessions.org/lab/building-a-vr-empathy-machine/\" class=\"linkified\">https://www.bordersessions.org/lab/building-a-vr-empathy-machine/</a></p> <p>Virtual Reality has an immersive power. It can teleport you into a place you have never been before, with people you have never seen before and still you will feel as you are really part of this virtual experience. VR is a new medium, with new rules, to create a world where anything is possible.</p> <p>As organizers of this lab, we try to enhance the empathy of visitors within our VR experiences in order to change perspective. This is not as simple as it seems. In this lab we are testing a 3 step method we have developed, to help awaken the empathy of youngsters who committed a crime. In multidisciplinary teams, which will include youngsters, we try out this 3 step method to create immersive virtual worlds.</p> <p>1. What information do you need to prepare the visitor of VR to change perspectives?<br/>2. How can we incorporate this information in a virtual world?<br/>3. How you construct a dialogue where the visitor is reflecting on the perspective change</p> <p>Yes, we will be building prototypes in one day! We experiment with 360 film, animation and tilt briush. So we are calling out to all storytellers, VR experts, social workers, visual and interaction designers, researchers, muncipalities or government. Anybody who would like to explore how VR can contribute in awaking empathy for a good cause.</p> <p>In the first half of the day we will work on understanding the topic from a youngsters perspective, create a storyline and explore sensory aspects to incorporate in the virtual environment. The other half we will spend on building (and testing) a rapid prototype.</p> <p>Although the main language of this lab is Dutch, we will make sure this will not be a problem for English speakers.</p> <p>More info: <a href=\"https://www.bordersessions.org/lab/building-a-vr-empathy-machine/\" class=\"linkified\">https://www.bordersessions.org/lab/building-a-vr-empathy-machine/</a></p>","event_url":"https://www.meetup.com/Hack-The-Planet/events/251432377/","yes_rsvp_count":6,"duration":25200000,"name":"Building a VR Empathy Machine","id":"251432377","photo_url":"https://secure.meetupstatic.com/photos/event/a/7/9/6/global_471762902.jpeg","time":1528876800000,"updated":1528904880000,"group":{"join_mode":"open","created":1513935630000,"name":"Hack The Planet","group_lon":4.28000020980835,"id":26936568,"urlname":"Hack-The-Planet","group_lat":52.08000183105469,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"'s-Gravenhage","address_1":"Den Haag","name":"Den Haag","lon":4.313685,"id":920683,"lat":52.078289,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1525794520000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>(Note: to finish your attendance, fill in this form: <a href=\"http://hack-the-planet.io/bordersessions/\" class=\"linkified\">http://hack-the-planet.io/bordersessions/</a>)</p> <p>Hackers of the world unite!</p> <p>Are you ready to hack the planet with your unique skills? Let’s join forces to take on some real global challenges! In collaboration with Border Sessions, Hack The Planet organizes a hackathon where you get the chance to work together with the main parties who are improving this world. Do you feel the drive to make positive impact?</p> <p>The collaborating organizations (last year, War Child and Oxfam were two of the NGOs taking part) will bring concrete challenges that they currently face, which may be solved with your knowledge about data science, your creativity in design, or any other particular skill you have. You will work in small teams to work on the problem that you are most eager to solve - and do invite your friends/colleagues if you're a strong team. The goal of the hackathon is to come to a solution that will actually be implemented right after the hackathon!</p> <p>Developers, designers, engineers, visionaries, entrepreneurs, strategists, artists: you’re all hackers during the Hack The Planet Hackathon at Border Sessions 2018!</p> <p>**Get your ticket to BorderSessions**<br/>If you are selected for the hackathon you will receive a ticket to BorderSessions for free! On the 2 non-hackathon days (13-14 June) you can follow some awesome sessions. at the conference. Check it out here: <a href=\"http://www.bordersessions.org/\" class=\"linkified\">http://www.bordersessions.org/</a></p> <p>**Details**<br/>Date: 15 &amp; 16 June<br/>Time: Day 1 (10:00-23:00), Day 2 (09:00-19:00)<br/>Location: The Hague (city centre : exact address will follow)</p> <p>To sign up, you need to fill in this form: <a href=\"http://hack-the-planet.io/bordersessions/\" class=\"linkified\">http://hack-the-planet.io/bordersessions/</a></p> <p>P.S. want to join in name of your company/organization? E-mail us: info[at]hack-the-planet.nl</p>","how_to_find_us":"Exact location in city centre TBA!","event_url":"https://www.meetup.com/Hack-The-Planet/events/250581727/","yes_rsvp_count":3,"duration":126000000,"name":"Hackathon Border Sessions: Hack The Planet","id":"250581727","photo_url":"https://secure.meetupstatic.com/photos/event/c/9/9/8/global_470931608.jpeg","time":1529049600000,"updated":1529179759000,"group":{"join_mode":"open","created":1513935630000,"name":"Hack The Planet","group_lon":4.28000020980835,"id":26936568,"urlname":"Hack-The-Planet","group_lat":52.08000183105469,"who":"Members"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":3,"link":"https://api.meetup.com/2/events","count":3,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=Hack-The-Planet&time=1514764800000%2C1546214400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1529179759000,"lat":""},"ratelimit":{"limit":"30","remaining":"26","reset":"5"}}