{"results":[{"utc_offset":3600000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Den Haag","address_1":"Maanweg 174","name":"Eurojust","lon":4.353386,"id":24403620,"lat":52.06814,"repinned":true},"rsvp_limit":25,"headcount":0,"visibility":"public","waitlist_count":0,"created":1541076468000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Please join us for the inaugural meeting of Haaglanden.scala. Our first meetup will take place at Cleverbase, Maanweg 174 Den Haag, which is conveniently located close to NS station Voorburg.</p> <p>The agenda:</p> <p>18:00 start with food and drinks</p> <p>19:00 Willem Vermeer of Cleverbase - \"Typed actors - should I start using them?\". This talk was also accepted for Scala Exchange London in December 2018</p> <p>\"Typed actors are finally here and for all of you lovers of typesafe programming - just their name is enough to get you excited! But here you are, maintaining a large scala/akka codebase - should you immediately migrate all your actors to typed actors? What will be the benefits and will your code look shinier when you're done? How are you going to sell this internal refactoring to the boss? In this talk, you will discover attempts to step into the world of typed actors. What was the impact, what have you learned, what is still missing and what did you end up with. The talk is aimed for you if you are interested in akka development but have not made the move to typed actors yet but may be wondering what you could be missing.\"</p> <p>19:45 break</p> <p>20:00 Marcel Matthijs of Tradecloud - \"How we integrated Apache Kafka into the Tradecloud architecture\"</p> <p>\"Apache Kafka looks very attractive at first sight when you are building<br/>available and scalable applications using Akka and Scala. Looking at your<br/>requirements, when do you decide to use Kafka or rather not? How does a<br/>software architecture and infrastructure using Kafka and Akka look like?<br/>What are recommended Scala libraries for using Kafka?</p> <p>We will quickly explain what Kafka does, introduce use cases of Kakfa, explain the event-driven software architecture and clustered infrastructure used at Tradecloud. We will zoom in on the Alpakka reactive streams Kafka connector (<a href=\"https://github.com/akka/alpakka-kafka\" class=\"linkified\">https://github.com/akka/alpakka-kafka</a>) and our Kafka Akka wrapper (<a href=\"https://github.com/tradecloud/akka-kafka\" class=\"linkified\">https://github.com/tradecloud/akka-kafka</a>) which makes your Kafka life just a bit easier.\"</p> <p>20:45 drinks</p> <p>21:30 the end</p> <p>The building is being renovated - do not let the decrepit atmosphere of the entrance scare you off. Pass through the glass doors and take a left to the elevators and get out at the 14th floor then take a right and ring the doorbell. For security reasons we will hand out personalised name tags when you enter.</p> <p>If you plan to come by car: do NOT park in the garage underneath the main building - it closes at 7pm! Instead try to park across the Maanweg - after 17:00 parking is free in this municipal zone.</p>","event_url":"https://www.meetup.com/Haaglanden-scala/events/256031002/","yes_rsvp_count":19,"duration":12600000,"name":"Kick-off with presentations on Kafka and Akka Typed Actors","id":"256031002","photo_url":"https://secure.meetupstatic.com/photos/event/a/e/5/d/global_475964637.jpeg","time":1543338000000,"updated":1543353701000,"group":{"join_mode":"open","created":1540935700000,"name":"Haaglanden.scala","group_lon":4.28000020980835,"id":30427792,"urlname":"Haaglanden-scala","group_lat":52.08000183105469,"who":"Members"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":1,"link":"https://api.meetup.com/2/events","count":1,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=Haaglanden-scala&time=1514764800000%2C1546214400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1543353701000,"lat":""},"ratelimit":{"limit":"30","remaining":"26","reset":"6"}}