{"results":[{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"'s-Gravenhage","address_1":"Saturnusstraat 60","name":"Caballero Fabriek","lon":4.345586,"id":4795852,"lat":52.065315,"repinned":false},"rsvp_limit":63,"headcount":0,"visibility":"public","waitlist_count":0,"created":1519393476000,"rating":{"count":3,"average":5},"maybe_rsvp_count":0,"description":"<p><a href=\"https://www.youtube.com/watch?v=HCbjZXfKSvk\" class=\"embedded\">https://www.youtube.com/watch?v=HCbjZXfKSvk</a><br/>We are kicking off our first meetup in the year.</p> <p>Talk # 1<br/>Jasper Moelker (Voorhoede) - Deep Dive into Progress Web Applications.<br/>Jasper along with his team at Voorhoede made it there goal to make every project they touched a Progress Web Application.<br/>(<a href=\"https://www.voorhoede.nl/en/blog/every-project-a-progressive-web-app/\" class=\"linkified\">https://www.voorhoede.nl/en/blog/every-project-a-progressive-web-app/</a> )</p> <p>Talk #2<br/>Bart Waardenburg(ANWB) - Creating a (p)react component library<br/>Working with multiple teams on multiple applications brings a whole new set of challenges to software development. Which code do you share, where do you draw the line and how do you work together keeping a certain amount of consistency. At the ANWB we’re currently tackling these problems and building a component library using (p)react. 1. The need for a structured component library. The tradeoffs between complete developer freedom and a rigid code regime.<br/>2. I want to share our learnings on how to use React or Preact on a generic component level and our decisions to move from React to Preact.<br/>3. How to build and use an individually versioned component system using tools like Lerna and Storybook.<br/>4. Challenges for the future<br/>(<a href=\"https://medium.com/@BartWaardenburg/creating-a-react-component-library-using-storybook-e7c3fd105fd5\" class=\"linkified\">https://medium.com/@BartWaardenburg/creating-a-react-component-library-using-storybook-e7c3fd105fd5</a>)</p> <p>ABOUT THE SPONSOR<br/>Worth Internet Systems(<a href=\"https://worth.systems\" class=\"linkified\">https://worth.systems</a>)</p> <p>For over 15 years, Worth Internet Systems has helped businesses and public sector organisations design, build and implement digital transformation solutions. As a strategic change partner, we work with clients in government, education, science, health and business to optimise customer and user experience, transform operational processes and create dynamic new business models. Using open source software and cloud tools, we develop flexible, agile solutions focused on the user. Our solutions incorporate intuitive interfaces, user-centric journeys and high levels of integration.</p> <p>Worth is a full-service digital agency based near Reading in the UK and The Hague in The Netherlands. Our team of more than 70 professionals has the business skills to develop strategy and the specialist technical expertise to deliver every phase of the project from concept, through development, user experience, testing and deployment. Using agile techniques, DevOps and high levels of automation, we deliver projects quickly and cost-effectively.</p>","how_to_find_us":"(Unit 63) call 0646839919","event_url":"https://www.meetup.com/Rotterdam-The-Hague-Front-end/events/248095570/","yes_rsvp_count":59,"duration":9000000,"name":"Frontend 2018","id":"248095570","time":1522339200000,"updated":1522405292000,"group":{"join_mode":"open","created":1484583293000,"name":"Rotterdam - The Hague Front-end","group_lon":4.28000020980835,"id":21954297,"urlname":"Rotterdam-The-Hague-Front-end","group_lat":52.08000183105469,"who":"Members"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"nl","localized_country_name":"Netherlands","city":"Rotterdam","address_1":"Delftseplein 27N 3013 AA","name":"Dept HQ","lon":4.472752,"id":25222402,"lat":51.924999,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":5,"created":1524391739000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Frontend 2018 Part II<br/>Hosted @ Dept.(Rotterdam)</p> <p>As per usual drinks and pizza will be available.</p> <p>The Talks:</p> <p>Hidde de Vries<br/>\"How we can now do lots of cool graphic design using CSS\"'</p> <p>The web is ready for great graphic design</p> <p>Some of the world's greatest print design was made on known canvases, with known content using known color options. On the web, we have more flexible tools. Media queries, flexible units, Grid Layout and Flexbox let us do great graphic design. With flexibility.</p> <p>In this talk Hidde will show some of the CSS that puts great graphic design into practice on the web. Get inspired by some of the icons from the history of graphic design, while learning new properties that you can use in projects today.</p> <p>*Hidde de Vries (@hdv) is a front-end web developer. On his blog he writes about HTML, CSS, JavaScript and accessibility. As a freelancer, he helps governments, organisations and companies with fast, scalable and accessible front-end solutions for their end users.</p> <p>------------------------------------------------------------------------------------------------------</p> <p>Diego Chávez<br/>\"React Sweet 16(XO)\"</p> <p>\"Finally all the features from your dreams appear from a magic portal, there are no error boundaries, there are pure fragments of love, every custom DOM attribute has a special place in the heart of static html. - -<br/>- React Sweet 16</p> <p>Diego will take your on a tour of React[masked]). Which with its updates included: fragments, error boundaries, portals, support for custom DOM attributes, improved server-side rendering, and reduced file size.</p> <p>*Diego Chávez (@diegochavez) is a front-end web developer from Guatemala . Skateboarder. Prefers React over AngularJS, but does Angular really good.</p>","event_url":"https://www.meetup.com/Rotterdam-The-Hague-Front-end/events/250030781/","yes_rsvp_count":64,"duration":8100000,"name":"Frontend 2018 Part II ( CSS vs React(JS) )","id":"250030781","time":1527004800000,"updated":1527014493000,"group":{"join_mode":"open","created":1484583293000,"name":"Rotterdam - The Hague Front-end","group_lon":4.28000020980835,"id":21954297,"urlname":"Rotterdam-The-Hague-Front-end","group_lat":52.08000183105469,"who":"Members"},"status":"past"}],"meta":{"next":"","method":"Events","total_count":2,"link":"https://api.meetup.com/2/events","count":2,"description":"Access Meetup events using a group, member, or event id. Events in private groups are available only to authenticated members of those groups. To search events by topic or location, see [Open Events](/meetup_api/docs/2/open_events).","lon":"","title":"Meetup Events v2","url":"https://api.meetup.com/2/events?offset=0&format=json&limited_events=False&group_urlname=Rotterdam-The-Hague-Front-end&time=1514764800000%2C1546214400000&page=200&fields=&key=2b2d6256e60525527675c6d494c4660&order=time&status=past&desc=false","id":"","updated":1527014493000,"lat":""},"ratelimit":{"limit":"30","remaining":"28","reset":"9"}}